<!-- dflook/terraform-github-actions {"workspace":"junit-xml","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"244cc0022ec3ca352168826a07440483934fb6f8fbeeadec529e933e438a1bbb","plan_job_ref":"Job Test actions using target and replace #461 at https://github.com/dflook/terraform-github-actions/actions/runs/13594321183","plan_hash":"436e5028595a5237bc793efd0fb4b6b43c9240160359c511a03d93eb7bf11900","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __junit-xml__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "qitsT7AHOz" -> (known after apply)
!~  foreach = "eU59eji4fN" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #461](https://github.com/dflook/terraform-github-actions/actions/runs/13594321183)